WD1CKS/Espruino/targetlibs/stm32f4/lib/stm32f4xx-old.h
#define  RCC_PLLI2SCFGR_PLLI2SN              ((uint32_t)0x00007FC0)
#define  RCC_PLLI2SCFGR_PLLI2SN_0            ((uint32_t)0x00000040)
#define  RCC_PLLI2SCFGR_PLLI2SN_1            ((uint32_t)0x00000080)
#define  RCC_PLLI2SCFGR_PLLI2SN_2            ((uint32_t)0x00000100)
#define  RCC_PLLI2SCFGR_PLLI2SN_3            ((uint32_t)0x00000200)
#define  RCC_PLLI2SCFGR_PLLI2SN_4            ((uint32_t)0x00000400)
#define  RCC_PLLI2SCFGR_PLLI2SN_5            ((uint32_t)0x00000800)
#define  RCC_PLLI2SCFGR_PLLI2SN_6            ((uint32_t)0x00001000)
#define  RCC_PLLI2SCFGR_PLLI2SN_7            ((uint32_t)0x00002000)
#define  RCC_PLLI2SCFGR_PLLI2SN_8            ((uint32_t)0x00004000)

#if defined(STM32F412xG) || defined(STM32F413_423xx)
#define  RCC_PLLI2SCFGR_PLLI2SSRC            ((uint32_t)0x00400000)
#endif /* STM32F412xG || STM32F413_423xx */

#if defined(STM32F446xx)
#define  RCC_PLLI2SCFGR_PLLI2SP              ((uint32_t)0x00030000)
#define  RCC_PLLI2SCFGR_PLLI2SP_0            ((uint32_t)0x00010000)
#define  RCC_PLLI2SCFGR_PLLI2SP_1            ((uint32_t)0x00020000)
#endif /* STM32F446xx */

#define  RCC_PLLI2SCFGR_PLLI2SQ              ((uint32_t)0x0F000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_0            ((uint32_t)0x01000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_1            ((uint32_t)0x02000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_2            ((uint32_t)0x04000000)
#define  RCC_PLLI2SCFGR_PLLI2SQ_3            ((uint32_t)0x08000000)

#define  RCC_PLLI2SCFGR_PLLI2SR              ((uint32_t)0x70000000)
#define  RCC_PLLI2SCFGR_PLLI2SR_0            ((uint32_t)0x10000000)
#define  RCC_PLLI2SCFGR_PLLI2SR_1            ((uint32_t)0x20000000)
#define  RCC_PLLI2SCFGR_PLLI2SR_2            ((uint32_t)0x40000000)

/********************  Bit definition for RCC_PLLSAICFGR register  ************/
#if defined(STM32F446xx)
#define  RCC_PLLSAICFGR_PLLSAIM              ((uint32_t)0x0000003F)
#define  RCC_PLLSAICFGR_PLLSAIM_0            ((uint32_t)0x00000001)
#define  RCC_PLLSAICFGR_PLLSAIM_1            ((uint32_t)0x00000002)
#define  RCC_PLLSAICFGR_PLLSAIM_2            ((uint32_t)0x00000004)
#define  RCC_PLLSAICFGR_PLLSAIM_3            ((uint32_t)0x00000008)
#define  RCC_PLLSAICFGR_PLLSAIM_4            ((uint32_t)0x00000010)
#define  RCC_PLLSAICFGR_PLLSAIM_5            ((uint32_t)0x00000020)
#endif /* STM32F446xx */

#define  RCC_PLLSAICFGR_PLLSAIN              ((uint32_t)0x00007FC0)
#define  RCC_PLLSAICFGR_PLLSAIN_0            ((uint32_t)0x00000040)
#define  RCC_PLLSAICFGR_PLLSAIN_1            ((uint32_t)0x00000080)
#define  RCC_PLLSAICFGR_PLLSAIN_2            ((uint32_t)0x00000100)
#define  RCC_PLLSAICFGR_PLLSAIN_3            ((uint32_t)0x00000200)
#define  RCC_PLLSAICFGR_PLLSAIN_4            ((uint32_t)0x00000400)
#define  RCC_PLLSAICFGR_PLLSAIN_5            ((uint32_t)0x00000800)
#define  RCC_PLLSAICFGR_PLLSAIN_6            ((uint32_t)0x00001000)
#define  RCC_PLLSAICFGR_PLLSAIN_7            ((uint32_t)0x00002000)
#define  RCC_PLLSAICFGR_PLLSAIN_8            ((uint32_t)0x00004000)

#if defined(STM32F446xx) || defined(STM32F469_479xx)  
#define  RCC_PLLSAICFGR_PLLSAIP              ((uint32_t)0x00030000)
#define  RCC_PLLSAICFGR_PLLSAIP_0            ((uint32_t)0x00010000)
#define  RCC_PLLSAICFGR_PLLSAIP_1            ((uint32_t)0x00020000)
#endif /* STM32F446xx || STM32F469_479xx */

#define  RCC_PLLSAICFGR_PLLSAIQ              ((uint32_t)0x0F000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_0            ((uint32_t)0x01000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_1            ((uint32_t)0x02000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_2            ((uint32_t)0x04000000)
#define  RCC_PLLSAICFGR_PLLSAIQ_3            ((uint32_t)0x08000000)

#define  RCC_PLLSAICFGR_PLLSAIR              ((uint32_t)0x70000000)
#define  RCC_PLLSAICFGR_PLLSAIR_0            ((uint32_t)0x10000000)
#define  RCC_PLLSAICFGR_PLLSAIR_1            ((uint32_t)0x20000000)
#define  RCC_PLLSAICFGR_PLLSAIR_2            ((uint32_t)0x40000000)

/********************  Bit definition for RCC_DCKCFGR register  ***************/
#define  RCC_DCKCFGR_PLLI2SDIVQ              ((uint32_t)0x0000001F)
#define  RCC_DCKCFGR_PLLSAIDIVQ              ((uint32_t)0x00001F00)
#define  RCC_DCKCFGR_PLLSAIDIVR              ((uint32_t)0x00030000)

#if defined(STM32F412xG) || defined(STM32F413_423xx)
#define  RCC_DCKCFGR_CKDFSDM1SEL             ((uint32_t)0x80000000)
#define  RCC_DCKCFGR_CKDFSDM1ASEL            ((uint32_t)0x00008000)
#endif /* STM32F412xG || STM32F413_423xx */

#if defined(STM32F413_423xx)
#define  RCC_DCKCFGR_PLLI2SDIVR              ((uint32_t)0x0000001F)
#define  RCC_DCKCFGR_PLLI2SDIVR_0            ((uint32_t)0x00000001)
#define  RCC_DCKCFGR_PLLI2SDIVR_1            ((uint32_t)0x00000002)
#define  RCC_DCKCFGR_PLLI2SDIVR_2            ((uint32_t)0x00000004)
#define  RCC_DCKCFGR_PLLI2SDIVR_3            ((uint32_t)0x00000008)
#define  RCC_DCKCFGR_PLLI2SDIVR_4            ((uint32_t)0x00000010)

#define  RCC_DCKCFGR_PLLDIVR                 ((uint32_t)0x00001F00)
#define  RCC_DCKCFGR_PLLDIVR_0               ((uint32_t)0x00000100)
#define  RCC_DCKCFGR_PLLDIVR_1               ((uint32_t)0x00000200)
#define  RCC_DCKCFGR_PLLDIVR_2               ((uint32_t)0x00000400)
#define  RCC_DCKCFGR_PLLDIVR_3               ((uint32_t)0x00000800)
#define  RCC_DCKCFGR_PLLDIVR_4               ((uint32_t)0x00001000)
#define  RCC_DCKCFGR_CKDFSDM2ASEL            ((uint32_t)0x00004000)
#endif /* STM32F413_423xx */

#define  RCC_DCKCFGR_SAI1ASRC                ((uint32_t)0x00300000)
#define  RCC_DCKCFGR_SAI1ASRC_0              ((uint32_t)0x00100000)
#define  RCC_DCKCFGR_SAI1ASRC_1              ((uint32_t)0x00200000)
#if defined(STM32F446xx)
#define  RCC_DCKCFGR_SAI1SRC                 ((uint32_t)0x00300000)
#define  RCC_DCKCFGR_SAI1SRC_0               ((uint32_t)0x00100000)
#define  RCC_DCKCFGR_SAI1SRC_1               ((uint32_t)0x00200000)
#endif /* STM32F446xx */

#define  RCC_DCKCFGR_SAI1BSRC                ((uint32_t)0x00C00000)
#define  RCC_DCKCFGR_SAI1BSRC_0              ((uint32_t)0x00400000)
#define  RCC_DCKCFGR_SAI1BSRC_1              ((uint32_t)0x00800000)
#if defined(STM32F446xx)
#define  RCC_DCKCFGR_SAI2SRC                 ((uint32_t)0x00C00000)
#define  RCC_DCKCFGR_SAI2SRC_0               ((uint32_t)0x00400000)
#define  RCC_DCKCFGR_SAI2SRC_1               ((uint32_t)0x00800000)
#endif /* STM32F446xx */

#define  RCC_DCKCFGR_TIMPRE                  ((uint32_t)0x01000000)
#if defined(STM32F469_479xx)
#define  RCC_DCKCFGR_CK48MSEL                ((uint32_t)0x08000000)
#define  RCC_DCKCFGR_SDIOSEL                 ((uint32_t)0x10000000)
#define  RCC_DCKCFGR_DSISEL                  ((uint32_t)0x20000000)
#endif /* STM32F469_479xx */

#if defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx)
#define  RCC_DCKCFGR_I2S1SRC                 ((uint32_t)0x06000000)
#define  RCC_DCKCFGR_I2S1SRC_0               ((uint32_t)0x02000000)
#define  RCC_DCKCFGR_I2S1SRC_1               ((uint32_t)0x04000000)
#define  RCC_DCKCFGR_I2S2SRC                 ((uint32_t)0x18000000)
#define  RCC_DCKCFGR_I2S2SRC_0               ((uint32_t)0x08000000)
#define  RCC_DCKCFGR_I2S2SRC_1               ((uint32_t)0x10000000)

/********************  Bit definition for RCC_CKGATENR register  ***************/
#define  RCC_CKGATENR_AHB2APB1_CKEN          ((uint32_t)0x00000001)
#define  RCC_CKGATENR_AHB2APB2_CKEN          ((uint32_t)0x00000002)
#define  RCC_CKGATENR_CM4DBG_CKEN            ((uint32_t)0x00000004)
#define  RCC_CKGATENR_SPARE_CKEN             ((uint32_t)0x00000008)
#define  RCC_CKGATENR_SRAM_CKEN              ((uint32_t)0x00000010)
#define  RCC_CKGATENR_FLITF_CKEN             ((uint32_t)0x00000020)
#define  RCC_CKGATENR_RCC_CKEN               ((uint32_t)0x00000040)
#if defined(STM32F412xG) || defined(STM32F413_423xx)
#define  RCC_CKGATENR_RCC_EVTCTL             ((uint32_t)0x00000080)
#endif /* STM32F412xG || STM32F413_423xx */

